; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	thermograph3 - mode
	thermograph2 - mode
	thermograph0 - mode
	image4 - mode
	image1 - mode
	Star6 - direction
	GroundStation13 - direction
	Star14 - direction
	GroundStation1 - direction
	Star8 - direction
	Star10 - direction
	GroundStation3 - direction
	Star7 - direction
	Star11 - direction
	Star5 - direction
	Star4 - direction
	GroundStation2 - direction
	Star0 - direction
	Star12 - direction
	GroundStation9 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star10)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star5)
	(supports instrument2 image1)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star8)
	(supports instrument3 image1)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 image1)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star5)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 Star4)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star17)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation9)
	(calibration_target instrument9 Star12)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite1 Star17)
	(pointing satellite2 Phenomenon16)
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph3)
	(have_image Star17 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation2 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 5
2. (turn_to satellite1 star17 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star17)
   goals met: 1 of 5
3. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 5
4. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 1 of 5
5. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
6. (calibrate satellite2 instrument7 groundstation2)
   added: (calibrated instrument7)
   goals met: 1 of 5
7. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 5
8. (turn_to satellite0 phenomenon16 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 5
9. (take_image satellite0 phenomenon16 instrument1 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 2 of 5
10. (turn_to satellite2 planet15 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet15)
   goals met: 2 of 5
11. (take_image satellite2 planet15 instrument7 image1)
   added: (have_image planet15 image1)
   goals met: 3 of 5
12. (turn_to satellite2 star17 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 star17)
   goals met: 3 of 5
13. (take_image satellite2 star17 instrument7 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 4 of 5
14. (turn_to satellite2 phenomenon16 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 phenomenon16)
   goals met: 5 of 5
